/*
Exercise 2: ทำไมคุณจะต้องไปเสียเงินเพื่อดูดวง ในเมื่อคุณสามารถเขียนโปรแกรมในการดูดวงอย่างง่ายได้ด้วยตัวเองแล้ว (อายุ) ? 

- เก็บค่าของปีที่คุณเกิดไว้ในตัวแปร birthYear
- เก็บค่าของปีที่กำลังจะมาถึงไว้ในตัวแปร futureYear
- จากค่าปีต่าง ๆ ที่เก็บไว้ ลองคำนวณอายุของคุณที่สามารถเป็นไปได้
- ยกตัวอย่างเช่น, ถ้าคุณเกิดในปี 1988, จากนั้นในปี 2026 คุณจะอายุ 37 หรือไม่ก็ 38, ขึ้นอยู่กับว่าตอนนั้นคือเดือนไหนในปี 2026
- ผลลัพธ์ของโปรแกรมของคุณ ควรจะแสดงผลได้ดังนี้: "I will be either NN or NN in YYYY." โดยแทนตัวแปรต่าง ๆ ด้วยตัวแปรของคุณเอง 
*/

let birthYear = 1991;
let futureYear = 2026;

let result = `I will be either ${futureYear - birthYear} or ${futureYear - birthYear + 1} in ${futureYear}.`;

console.log(result);